Plan1x/Library-for-Addressable-LED-strip-on-Stm32-and-HAL/Core/Inc/ws2812b.h
/*
 * ws2812b.h
 *
 *  Created on: Jul 26, 2024
 *      Author: irubt
 */

#ifndef INC_WS2812B_H_
#define INC_WS2812B_H_

/* Includes ------------------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "main.h"
#include "stdbool.h"

#define STM32F1

#ifdef STM32F1
    #include "stm32f1xx_hal_conf.h"

#elif defined(STM32F2)
    #include "stm32f2xx_hal_conf.h"

#elif defined(STM32F3)
    #include "stm32f3xx_hal_conf.h"

#elif defined(STM32F4)
    #include "stm32f4xx_hal_conf.h"

#elif defined(STM32F7)
    #include "stm32f7xx_hal_conf.h"

#elif defined(STM32H7)
    #include "stm32h7xx_hal_conf.h"

#elif defined(STM32L0)
    #include "stm32l0xx_hal_conf.h"

#elif defined(STM32L1)
    #include "stm32l1xx_hal_conf.h"

#elif defined(STM32L4)
    #include "stm32l4xx_hal_conf.h"

#elif defined(STM32L5)
    #include "stm32l5xx_hal_conf.h"

#elif defined(STM32G0)
    #include "stm32g0xx_hal_conf.h"

#elif defined(STM32G4)
    #include "stm32g4xx_hal_conf.h"

#elif defined(STM32WB)
    #include "stm32wbxx_hal_conf.h"

#elif defined(STM32WL)
    #include "stm32wlxx_hal_conf.h"

#elif defined(STM32MP1)
    #include "stm32mp1xx_hal_conf.h"

#endif

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef uint8_t U8;
typedef uint16_t U16;
typedef uint32_t U32;
/* USER CODE END PTD */



/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */


#define DWT_CONTROL *(volatile unsigned long *)0xE0001000
#define SCB_DEMCR   *(volatile unsigned long *)0xE000EDFC






#define PIXELS_COUNT 120 // Changeable parameter(number of pixels in your led strip)

#define BITS_IN_PIXEL 24
#define BYTE 8

#define TIME_TO_RST 50 // Should be greater than 50 us

#define LEDS_COUNT (PIXELS_COUNT * BITS_IN_PIXEL) + TIME_TO_RST

/* USER CODE END PD */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */



/*
 * ENUMS
 */
typedef enum
{
	PERIOD = 90 - 1,
	LOGIC_ZERO = 26 - 1, // in ns
	LOGIC_ONE = 65 - 1 // in ns

} Led_states;

typedef enum
{
	GREEN = 0,
	RED = 1,
	BLUE = 2

}Colors;

/*
 * ENUMS
 */

/*
 * STRUCTS
 */
typedef struct
{
	U8 Red;
	U8 Green;
	U8 Blue;

}Color;

typedef struct
{
	U16 buffer[LEDS_COUNT];
	TIM_HandleTypeDef * htim1;
	TIM_TypeDef * TIM;

}Strip;

typedef struct
{
	void (*init)(TIM_HandleTypeDef *, TIM_TypeDef *);
	void (*set_pixel)(U8,U8,U8,U8);
	void (*setstrip)(Color *_Col);
	void (*show)(U16 Delay);
	void (*moving_effect_two_colors)(Color *_Col_1, Color * _Col_2,  U16 Delay);
	void (*moving_effect_three_colors)(Color *_Col_1, Color * _Col_2, Color * _Col_3, U16 Delay);
	void (*sliding_effect)(Color *_Col_1, Color * _Col_2, Color * _Col_3, U16 Delay);
	void (*moving_and_vanishing_effect)(Color *_Col_1, Color * _Col_2, U16 Delay);
	void(*delay_in_us)(U32 us);

}WS2812;

/*
 * STRUCTS
 */

/* USER CODE END PV */


/* Private function prototypes -----------------------------------------------*/

/* USER CODE BEGIN PFP */


/*
 * Description : Initializes the led strip by filling it with Black color
 *
 * Prototype : void ws2812b_init(void);
 *
 *
 *
 *
 */


//void ws2812b_init(void);

/*
 * Description : Lights up specified pixel with specified color
 *
 * Prototype : void ws2812b_setpixel(U8 Green, U8 Red, U8 Blue, U8 Pixelnum);
 *
 * Parameters :
 *
 * U8 Green - Sets the brightness of Green color led from 0 to 255
 *
 * U8 Red - Sets the brightness of Red color led from 0 to 255
 *
 * U8 Blue - Sets the brightness of Blue color led from 0 to 255
 *
 * U8 Pixelnum - Pixel number that you want to light up
 *
 * !! Pixelnum parameter starts from zero, that means that if you want to light up the first pixel, you should set Pixelnum as 0 !!
 * !! Last pixel index is Pixelnum = (PIXELS_COUNT - 1) !!
 */

void ws2812b_setpixel(U8 Red, U8 Green, U8 Blue, U8 Pixelnum);

/*
 * Description : Initializes the Strip struct fields(constructor)
 *
 * Prototype ws2812b_new_strip(TIM_HandleTypeDef *  htim);
 *
 * Parameters :
 *
 * TIM_HandleTypeDef *  htim - pointer on object of TIM_HandleTypeDef struct
 *
 */

void ws2812b_init(TIM_HandleTypeDef *  htim, TIM_TypeDef *);

 /*
  * Description : Lights up the whole strip with specified color
  *
  * Prototype : void ws2812b_setstrip(U8 Green, U8 Red, U8 Blue);
  *
  * Parameters :
  *
  * U8 Green - Sets the brightness of Green color in the whole stripe from 0 to 255
  *
  * U8 Red - Sets the brightness of Red color in the whole stripe from 0 to 255
  *
  * U8 Blue - Sets the brightness of Blue color in the whole stripe from 0 to 255
  */
void ws2812b_setstrip(Color *_Col);

/*
 * Description : Sends the specified effect to strip
 *
 * Prototype : void ws2812b_show(U8 Delay);
 *
 * Parameters :
 *
 * U8 Delay - transferring data speed
 */

void ws2812b_show(U16 Delay);


/*
 *
 * EFFECTS FUNCTIONS
 *
 */

/* Description : Dynamic effect #1
 *
 * Prototype : void ws2812b_moving_effect_two_colors(U8 Color_1, U8 Color_2, Colors * Color_palette, U16 Delay);
 *
 *
 * Parameters :
 *
 * U8 Color_1 - Sets specified color #1 brightness from 0 to 255
 *
 * U8 Color_2 - Sets specified color #2 brightness from 0 to 255
 *
 * Colors * Color_palette - Pointer to Colors array
 *
 * U8 Delay - Sets the moving speed(recommended minimum is 10)
 *
 */

void ws2812b_moving_effect_two_colors(Color *_Col_1, Color * _Col_2,  U16 Delay);

/*
 * Description : Dynamic effect #2
 *
 * Prototype : void ws2812b_moving_effect_three_colors(U8 Red, U8 Green, U8 Blue, U16 Delay);
 *
 * Parameters :
 *
 * U8 Red - Sets the brightness of Red color from 0 to 255
 *
 * U8 Green - Sets the brightness of Green color from 0 to 255
 *
 * U8 Blue - Sets the brightness of Blue color from 0 to 255
 *
 * U8 Delay - Sets the moving speed(recommended minimum is 10)
 *
 */

void ws2812b_moving_effect_three_colors(Color *_Col_1, Color * _Col_2, Color * _Col_3, U16 Delay);

/* Description : Dynamic effect #3
 *
 * Prototype : void ws2812b_sliding_effect(U8 Red, U8 Green, U8 Blue, U16 Delay);
 *
 * Parameters :
 *
 * U8 Red - Sets the brightness of Red color from 0 to 255
 *
 * U8 Green - Sets the brightness of Green color from 0 to 255
 *
 * U8 Blue - Sets the brightness of Blue color from 0 to 255
 *
 * U8 Delay - Sets the moving speed(recommended minimum is 10)
 *
 */

void ws2812b_sliding_effect(Color *_Col_1, Color * _Col_2, Color * _Col_3, U16 Delay);



/* Description : Dynamic effect #4
 *
 * Prototype : ws2812b_moving_and_vanishing_effect(U8 Color_1, U8 Color_2, Colors * Color_palette, U16 Delay);
 *
 * Parameters :
 *
 * U8 Color_1_brightness - Sets specified color #1 brightness from 0 to 255
 *
 * U8 Color_2_brightness - Sets specified color #2 brightness from 0 to 255
 *
 * Colors * Color_palette - Pointer to Colors array
 *
 * U8 Delay - Sets the moving speed(recommended minimum is 10)
 *
 */

void ws2812b_moving_and_vanishing_effect(Color *_Col_1, Color * _Col_2, U16 Delay);


/*
 * Description : Constructor
 *
 * Prototype : WS2812 new_Strip(WS2812 * _Strip);
 *
 * Parameters :
 *
 * WS2812 * _Strip - Pointer to an object of type WS2812
 */
WS2812 new_Strip(WS2812 * _Strip);


/*
 * Description : Delay in microseconds
 *
 * Prototype : void ws2812b_delay_in_microseconds(U32 us);
 *
 * Parameters :
 *
 * U32 us - Delay time(in microseconds)
 */
void ws2812b_delay_in_microseconds(U32 us);

/* USER CODE END PFP */


#endif /* INC_WS2812B_H_ */
